ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`id_kategori` = '1'
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
WHERE `artikel`.`id_kategori` = '1'
ORDER BY `artikel`.`judul` ASC
 LIMIT 5
---
    public function admin_index()
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $sort = $this->request->getVar('sort') ?? '';

        if ($sort == 'judul_asc') {
            $builder->orderBy('artikel.judul', 'ASC');
        } elseif ($sort == 'judul_desc') {
            $builder->orderBy('artikel.judul', 'DESC');
        }

        $artikel = $builder->paginate(5, 'default', $page);

SELECT *
FROM `kategori`
---
            return $this->response->setJSON($data);
        } else {
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();

INSERT INTO `artikel` (`judul`, `isi`, `id_kategori`, `slug`, `gambar`) VALUES ('Megawati Hangestri: Kebanggaan Voli Indonesia di Liga Korea', 'Megawati Hangestri Pertiwi, atau yang akrab dijuluki “Megatron”, telah menjadi sorotan setelah menjadi pemain voli perempuan pertama dari Indonesia dan berjilbab yang tampil di Korean V‑League bersama Daejeon Red Sparks sejak April 2023 Debutnya pada Oktober 2023 langsung menggetarkan lapangan dengan mencetak 21 poin dan merebut gelar MVP, membantu timnya mencapai babak playoff setelah tujuh tahun absen Meski sempat mengalami cedera lutut, semangat dan konsistensinya terbukti saat mencetak 143 poin hanya dalam enam laga di musim semi 2025 Megawati juga membawa dampak besar di luar negeri—meningkatkan engagement fans dan menginspirasi banyak atlet muda Indonesia untuk berani berkiprah di level internasional.', '2', 'megawati-hangestri-kebanggaan-voli-indonesia-di-liga-korea', 'megawati hangestri.jpg')
---
    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required'
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $namaGambar = '';

            if ($file && $file->isValid()) {
                // Pindahkan file gambar ke folder gambar
                $file->move(ROOTPATH . 'public/gambar');
                $namaGambar = $file->getName();
            }

            $artikel = new ArtikelModel();
            // Pastikan slug unik
            $slug = url_title($this->request->getPost('judul'), '-', true);

            // Insert data artikel
            $artikel->insert([
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'slug'        => $slug,
                'gambar'      => $namaGambar,
            ]);

SELECT *
FROM `kategori`
---

        $title = "Tambah Artikel";
        $kategoriModel = new KategoriModel();
        $kategori = $kategoriModel->findAll();