ci4/app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ];
        $model->insert($data);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Judul Artikel 7', 'Isi Artikel ke 7 ditambah melalui API by Nurulfir')

    public function show($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '1'
 LIMIT 1

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);
        if ($data) {
            $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` = '7'
AND `id` IN ('7')
DELETE FROM `artikel`
WHERE `id` IN ('7')